laval/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type           zeroGradient; 
    }

    atm1
    {
        type            zeroGradient;
    }

    atm2
    {
        type            zeroGradient;
    }

    atm3
    {
        type            zeroGradient;
    }

    wall
    {
        type            noSlip;
    }

    wedge0
    {
        type            wedge;
    }
    wedge1
    {
        type            wedge;
    }


}

// ************************************************************************* //
