laval/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;
boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1013250;
    }

    atm1
    {
        type            zeroGradient;
    }
    atm2
    {
    type            fixedValue;
    value           uniform 101325;
//        type            zeroGradient;
    }
    atm3
    {
        type            fixedValue;
        value           uniform 101325;
    }
    wall
    {
        type            zeroGradient;
    }
    wedge0
    {
        type            wedge;
    }
    wedge1
    {
        type            wedge;
    }
}


// ************************************************************************* //
