laval/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue p 101325
    volScalarFieldValue T 300
);

regions
(
    boxToCell
    {
        box (0 0 -1) (0.08 0.03 1);
        fieldValues
        (
            volScalarFieldValue p 1013250
            volScalarFieldValue T 600
        );
    }
);


// ************************************************************************* //
